<a href="https://colab.research.google.com/github/ArpulaAnjali/B19_1319/blob/main/Lab4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print("Panda series")
print(series)

Panda series
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
#Custom index
data=[10,20,30,40,50]
index_label=['a','b','c','d','e']
series=pd.Series(data,index=index_label)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
data={
    'name':['alice','bob','charlie'],
    'age':[25,30,35],
    'city':['New York','San Francisco','Los Angeles']
}
df=pd.DataFrame(data)
print(df)

      name  age           city
0    alice   25       New York
1      bob   30  San Francisco
2  charlie   35    Los Angeles

In [6]:
print(df['name'])
print(df[['name',"city"]])
print(df.iloc[1])
print(df.loc[2])
df['Salary']=[40000,50000,60000]
print(df)
df=df.drop('city',axis=1)
print(df)

0      alice
1        bob
2    charlie
Name: name, dtype: object
      name           city
0    alice       New York
1      bob  San Francisco
2  charlie    Los Angeles
name              bob
age                30
city    San Francisco
Name: 1, dtype: object
name        charlie
age              35
city    Los Angeles
Name: 2, dtype: object
      name  age           city  Salary
0    alice   25       New York   40000
1      bob   30  San Francisco   50000
2  charlie   35    Los Angeles   60000
      name  age  Salary
0    alice   25   40000
1      bob   30   50000
2  charlie   35   60000

In [8]:
print(df[df['age']>30])
print(df['age'].mean())
print(df['age'].max())
print(df['age'].min())

      name  age  Salary
2  charlie   35   60000
30.0
35
25

In [11]:
student_data={
    'sid':[101,102,103,104],
    'name':['ravi','neha','kiran','sita'],
    'marks':[85,90,78,92],
    'Department':['CSE','ECE','MECH','CSE']
}
df=pd.DataFrame(student_data)
print("Student Data")
print(df)

Student Data
   sid   name  marks Department
0  101   ravi     85        CSE
1  102   neha     90        ECE
2  103  kiran     78       MECH
3  104   sita     92        CSE

In [14]:
import pandas as pd

data = {
    "sname": ["Anjali", "Palomi","Ashwitha", "Ramu","Raju"],
    "sroll": [1319, 1233, 1340, 1232,1243],
    "m1": [55, 35, 72, 90,50],
    "m2": [65, 45, 60, 85,67],
    "m3": [70, 38, 50, 95,78]
}
df = pd.DataFrame(data)
df["total"] = df[["m1", "m2", "m3"]].sum(axis=1)
df["avg"] = df["total"] / 3
df["result"] = ['pass' if m1 > 40 else 'fail ' for m1 in df['m1']]
print(df)

      sname  sroll  m1  m2  m3  total        avg result
0    Anjali   1319  55  65  70    190  63.333333   pass
1    Palomi   1233  35  45  38    118  39.333333  fail
2  Ashwitha   1340  72  60  50    182  60.666667   pass
3      Ramu   1232  90  85  95    270  90.000000   pass
4      Raju   1243  50  67  78    195  65.000000   pass